aeroHPC/OpenFOAM/tutorials/shockThermo/shockTube/system/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  12
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

defaultFieldValues 
( 
    volVectorFieldValue U (0 0 0) 
    volScalarFieldValue T 0.00348 
    volScalarFieldValue p 1 
);

regions
(
    boxToCell
    {
        box (0.5 -1 -1) (1 1 1);
        fieldValues
        (
            volScalarFieldValue T 0.00278
            volScalarFieldValue p 0.1
        ); 
     } 
);


// ************************************************************************* //
