aeroHPC/OpenFOAM/tutorials/shockThermo/shockTube/Allrun.post
#!/bin/sh
cd ${0%/*} || exit 1    # Run from this directory

# Source tutorial run functions
. $WM_PROJECT_DIR/bin/tools/RunFunctions

runApplication -s sample foamPostProcess -func sample

cd validation && ./createGraphs

#------------------------------------------------------------------------------
